# Data Cleaning

https://www.kaggle.com/datasets/gregorut/videogamesales

In [1]:
import pandas as pd
import numpy as np

## Setup

In [19]:
df = pd.read_csv(
    'vgsales.csv',
    dtype={
        "Rank": np.int16,
        "NA_Sales": np.float32,
        "EU_Sales": np.float32,
        "JP_Sales":	np.float32,
        "Other_Sales": np.float32,
        "Global_Sales": np.float32,
    },
    index_col=0
)
df

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Rank,,,,,,,,,,
1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.490002,29.02,3.77,8.46,82.739998
2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.080000,3.58,6.81,0.77,40.240002
3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.850000,12.88,3.79,3.31,35.820000
4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.750000,11.01,3.28,2.96,33.000000
5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.270000,8.89,10.22,1.00,31.370001
...,...,...,...,...,...,...,...,...,...,...
16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.010000,0.00,0.00,0.00,0.010000
16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.010000,0.00,0.00,0.00,0.010000
16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.000000,0.00,0.00,0.00,0.010000
16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.000000,0.01,0.00,0.00,0.010000
16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.010000,0.00,0.00,0.00,0.010000

In [20]:
df.info()

<class 'pandas.DataFrame'>
Index: 16598 entries, 1 to 16600
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          16598 non-null  str
 1   Platform      16598 non-null  str
 2   Year          16327 non-null  float64
 3   Genre         16598 non-null  str
 4   Publisher     16540 non-null  str
 5   NA_Sales      16598 non-null  float32
 6   EU_Sales      16598 non-null  float32
 7   JP_Sales      16598 non-null  float32
 8   Other_Sales   16598 non-null  float32
 9   Global_Sales  16598 non-null  float32
dtypes: float32(5), float64(1), str(4)
memory usage: 1005.0 KB

## Cleaning Missing Data

### how many data are missing

In [21]:
df.isna().sum()

Name              0
Platform          0
Year            271
Genre             0
Publisher        58
NA_Sales          0
EU_Sales          0
JP_Sales          0
Other_Sales       0
Global_Sales      0
dtype: int64

### how to clean up ?
to clean up the data we have 2 options

1. remove the row if the missing value is needed
2. fill the missing values with a value

<p dir='rtl'>
لتنظيف البيانات لدينا طريقتين
</p>

<ol dir='rtl'>
    <li>حذف الصف كاملاً إذا كانت المعلومه مهمه</li>
    <li>ملء المفقود بقيمة اخرى</li>
</ol>

#### 1. Removing Rows

In [14]:
df.dropna(inplace=True)

In [16]:
df.isna().sum()

Name            0
Platform        0
Year            0
Genre           0
Publisher       0
NA_Sales        0
EU_Sales        0
JP_Sales        0
Other_Sales     0
Global_Sales    0
dtype: int64

#### 2. Fiil mssing values

In [22]:
df['Year'] = df['Year'].fillna(0)
df['Publisher'] = df['Publisher'].fillna('Unknown')

In [23]:
df.isnull().sum()

Name            0
Platform        0
Year            0
Genre           0
Publisher       0
NA_Sales        0
EU_Sales        0
JP_Sales        0
Other_Sales     0
Global_Sales    0
dtype: int64

## improving the data type for a better memory

In [24]:
df['Year'] = df['Year'].astype(np.int16)

In [25]:
df.info()

<class 'pandas.DataFrame'>
Index: 16598 entries, 1 to 16600
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          16598 non-null  str
 1   Platform      16598 non-null  str
 2   Year          16598 non-null  int16
 3   Genre         16598 non-null  str
 4   Publisher     16598 non-null  str
 5   NA_Sales      16598 non-null  float32
 6   EU_Sales      16598 non-null  float32
 7   JP_Sales      16598 non-null  float32
 8   Other_Sales   16598 non-null  float32
 9   Global_Sales  16598 non-null  float32
dtypes: float32(5), int16(1), str(4)
memory usage: 907.7 KB

## checking Global Sales

In [26]:
sales_columns = df[['NA_Sales', "EU_Sales", 'JP_Sales', "Other_Sales"]]

In [27]:
calculated_global_sales = sales_columns.sum(axis=1).round(2)
calculated_global_sales

Rank
1        82.739998
2        40.240002
3        35.830002
4        33.000000
5        31.379999
           ...
16596     0.010000
16597     0.010000
16598     0.000000
16599     0.010000
16600     0.010000
Length: 16598, dtype: float32

In [28]:
df['is_global_ok'] = calculated_global_sales == df['Global_Sales']

In [29]:
sales_columns.join(df[['Global_Sales', 'is_global_ok']])

        NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales  is_global_ok
Rank
1      41.490002     29.02      3.77         8.46     82.739998          True
2      29.080000      3.58      6.81         0.77     40.240002          True
3      15.850000     12.88      3.79         3.31     35.820000         False
4      15.750000     11.01      3.28         2.96     33.000000          True
5      11.270000      8.89     10.22         1.00     31.370001         False
...          ...       ...       ...          ...           ...           ...
16596   0.010000      0.00      0.00         0.00      0.010000          True
16597   0.010000      0.00      0.00         0.00      0.010000          True
16598   0.000000      0.00      0.00         0.00      0.010000         False
16599   0.000000      0.01      0.00         0.00      0.010000          True
16600   0.010000      0.00      0.00         0.00      0.010000          True

[16598 rows x 6 columns]

In [30]:
df['is_global_ok'].value_counts()

is_global_ok
True     12087
False     4511
Name: count, dtype: int64

lets fix it
<p dir='rtl'>
لنصلحها
</p>

In [31]:
df['Global_Sales'] = calculated_global_sales
df['is_global_ok'] = calculated_global_sales == df['Global_Sales']

In [32]:
sales_columns.join(df[['Global_Sales', 'is_global_ok']])

        NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales  is_global_ok
Rank
1      41.490002     29.02      3.77         8.46     82.739998          True
2      29.080000      3.58      6.81         0.77     40.240002          True
3      15.850000     12.88      3.79         3.31     35.830002          True
4      15.750000     11.01      3.28         2.96     33.000000          True
5      11.270000      8.89     10.22         1.00     31.379999          True
...          ...       ...       ...          ...           ...           ...
16596   0.010000      0.00      0.00         0.00      0.010000          True
16597   0.010000      0.00      0.00         0.00      0.010000          True
16598   0.000000      0.00      0.00         0.00      0.000000          True
16599   0.000000      0.01      0.00         0.00      0.010000          True
16600   0.010000      0.00      0.00         0.00      0.010000          True

[16598 rows x 6 columns]

In [33]:
df['is_global_ok'].value_counts()

is_global_ok
True    16598
Name: count, dtype: int64

## Saving

### CSV

In [104]:
df.to_csv("cleaned_vgsales.csv")

### Excel

to save to an `xlsx` format, wee need to install `openpyxl`
<p dir='rtl'>للحفظ فى ملف <code>ُxlsx</code> يجب تنزيل مكتبة <code>openpyxl</code></p>

`pip install openpyxl`

In [103]:
df.to_excel("cleaned_vgsales.xlsx")